Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.40/edc/ATSAMR30G18A.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M0PLUS" atdf:family="SAMR" edc:arch="arm32bit" edc:atsamname="ATSAMR30G18A" edc:hasFreeze="false" edc:name="ATSAMR30G18A" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.63" edc:minvoltage="1.62" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true"/>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv6m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="SYSTEM" edc:desc="System peripherals shared interrupt" edc:irq="0" ltx:memberofperipheral="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC"/>
    <edc:Interrupt edc:cname="WDT" edc:desc="Watchdog Timer" edc:irq="1" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Counter" edc:irq="2" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:cname="EIC" edc:desc="External Interrupt Controller" edc:irq="3" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:cname="NVMCTRL" edc:desc="Non-Volatile Memory Controller" edc:irq="4" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:cname="DMAC" edc:desc="Direct Memory Controller" edc:irq="5" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:cname="USB" edc:desc="Universal Serial Bus" edc:irq="6" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:cname="EVSYS" edc:desc="Event Systems" edc:irq="7" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:cname="SERCOM0" edc:desc="Serial Communication Interface 0" edc:irq="8" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:cname="SERCOM1" edc:desc="Serial Communication Interface 1" edc:irq="9" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:cname="SERCOM2" edc:desc="Serial Communication Interface 2" edc:irq="10" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:cname="SERCOM3" edc:desc="Serial Communication Interface 3" edc:irq="11" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:cname="SERCOM4" edc:desc="Serial Communication Interface 4" edc:irq="12" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:cname="SERCOM5" edc:desc="Serial Communication Interface 5" edc:irq="13" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:cname="TCC0" edc:desc="Timer/Counter for Control Applications 0" edc:irq="14" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:cname="TCC1" edc:desc="Timer/Counter for Control Applications 1" edc:irq="15" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:cname="TCC2" edc:desc="Timer/Counter for Control Applications 2" edc:irq="16" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:cname="TC0" edc:desc="Timer/Counter 0" edc:irq="17" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:cname="TC1" edc:desc="Timer/Counter 1" edc:irq="18" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:cname="TC4" edc:desc="Timer/Counter 4" edc:irq="21" ltx:memberofperipheral="TC4"/>
    <edc:Interrupt edc:cname="ADC" edc:desc="Analog-to-Digital Converter" edc:irq="22" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:cname="AC" edc:desc="Analog Comparators" edc:irq="23" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:cname="PTC" edc:desc="Peripheral Touch Controller" edc:irq="25" ltx:memberofperipheral="PTC"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="MCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="MTB" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="OSCCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OSC32KCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RFCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC4" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnn---n------------------nnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xF100003F" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnn----------------------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF0000000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="--------------------------rrrrrr" edc:cname="IPSR" edc:desc="Interrupt Program Status Register" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nmmrid="80" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------r------------------------" edc:cname="EPSR" edc:desc="Execution Program Status Register" edc:impl="0x1000000" edc:mclr="00000001000000000000000000000000" edc:nmmrid="84" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK" edc:desc="Priority Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="88" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------------nn" edc:cname="CONTROL" edc:desc="Control Register" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nmmrid="100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
    </edc:NMMRPlace>
    <edc:CodeSector atdf:pagesize="0x40" edc:beginaddr="0x0" edc:endaddr="0x40000" edc:regionid="IFLASH" edc:rw="rw"/>
    <edc:UserZone atdf:pagesize="0x40" edc:beginaddr="0x804000" edc:endaddr="0x804100" edc:regionid="USER_PAGE" edc:rw="rw"/>
    <edc:ConfigFuseSector atdf:pagesize="0x40" edc:beginaddr="0x804000" edc:endaddr="0x804008" edc:regionid="fuses">
      <edc:DCRDef edc:_addr="0x804000" edc:access="nnnnnn--n------nnnnnnnnn-nnn-nnn" edc:cname="USER_WORD_0" edc:default="0x0" edc:factorydefault="0x0" edc:impl="0xFC81FF77" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NVMCTRL_BOOTPROT" edc:desc="Bootloader Size" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_EEPROM_SIZE" edc:desc="EEPROM Size" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOD33USERLEVEL" edc:desc="BOD33 User Level" edc:nzwidth="0x6"/>
            <edc:DCRFieldDef edc:cname="BOD33_DIS" edc:desc="BOD33 Disable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD33_ACTION" edc:desc="BOD33 Action" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:DCRFieldDef edc:cname="BOD12_DIS" edc:desc="BOD12 Disable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="WDT_ENABLE" edc:desc="WDT Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_ALWAYSON" edc:desc="WDT Always On" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_PER" edc:desc="WDT Period" edc:nzwidth="0x4"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x804004" edc:access="nnnnnnnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="USER_WORD_1" edc:default="0x0" edc:factorydefault="0x0" edc:impl="0xFFFF07FF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="WDT_WINDOW" edc:desc="WDT Window" edc:nzwidth="0x4"/>
            <edc:DCRFieldDef edc:cname="WDT_EWOFFSET" edc:desc="WDT Early Warning Offset" edc:nzwidth="0x4"/>
            <edc:DCRFieldDef edc:cname="WDT_WEN" edc:desc="WDT Window Mode Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD33_HYST" edc:desc="BOD33 Hysteresis" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD12_HYST" edc:desc="BOD12 Hysteresis" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_REGION_LOCKS" edc:desc="NVM Region Locks" edc:nzwidth="0x10"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector atdf:pagesize="0x40" edc:beginaddr="0x804008" edc:endaddr="0x804100" edc:regionid="userid"/>
    <edc:CodeSector atdf:pagesize="0x40" edc:beginaddr="0x400000" edc:endaddr="0x402000" edc:regionid="RWW" edc:rw="rw"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20008000" edc:isexecutable="true" edc:regionid="HSRAM" edc:rw="rw"/>
    <edc:GPRDataSector edc:beginaddr="0x30000000" edc:endaddr="0x30002000" edc:isexecutable="true" edc:regionid="LPRAM" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x40004000" edc:regionid="HPB0" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x41000000" edc:endaddr="0x41010000" edc:regionid="HPB1" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x42008000" edc:regionid="HPB2" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x43000000" edc:endaddr="0x43002000" edc:regionid="HPB3" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x44000000" edc:endaddr="0x44001000" edc:regionid="HPB4" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0xE0000000" edc:endaddr="0xE000ED34" edc:regionid="PPB" edc:rw="rw">
      <edc:AdjustPoint edc:_addr="0xE0000000" edc:offset="0xE004"/>
      <edc:SFRDef edc:_addr="0xE000E004" edc:access="----------------------------rrrr" edc:cname="ICTR" edc:desc="Interrupt Controller Type Register" edc:impl="0xF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32." edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE000E010" edc:access="---------------n-------------nnn" edc:cname="CSR" edc:impl="0x10007" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SysTick Counter Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counter disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counter enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:desc="SysTick Exception Request Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counting down to 0 does not assert the SysTick exception request" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counting down to 0 asserts the SysTick exception request" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:desc="Clock Source 0=external, 1=processor" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="External clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Processor clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:desc="Timer counted to 0 since last read of register" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E014" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RVR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="RELOAD" edc:desc="Value to load into the SysTick Current Value Register when the counter reaches 0" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
