Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.40/edc/ATSAMR30G18A.PIC
      <edc:SFRDef edc:_addr="0x4400040D" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4400040E" edc:access="--nnnnnn" edc:cname="QOSCTRL" edc:impl="0x3F" edc:mclr="00101010" edc:nzwidth="0x8" edc:por="00101010" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBQOS" edc:desc="Write-Back Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FQOS" edc:desc="Fetch Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DQOS" edc:desc="Data Transfer Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Background (no sensitive operation)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Sensitive Bandwidth" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MEDIUM" edc:desc="Sensitive Latency" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Critical Latency" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4400040F" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x44000410" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SWTRIGCTRL" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:desc="Channel 0 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:desc="Channel 1 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:desc="Channel 2 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:desc="Channel 3 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:desc="Channel 4 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:desc="Channel 5 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:desc="Channel 6 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:desc="Channel 7 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:desc="Channel 8 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:desc="Channel 9 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:desc="Channel 10 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:desc="Channel 11 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG12" edc:desc="Channel 12 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG13" edc:desc="Channel 13 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG14" edc:desc="Channel 14 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG15" edc:desc="Channel 15 Software Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000414" edc:access="n---nnnnn---nnnnn---nnnnn---nnnn" edc:cname="PRICTRL0" edc:impl="0x8F8F8F8F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:desc="Level 0 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:desc="Level 0 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:desc="Level 1 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:desc="Level 1 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:desc="Level 2 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:desc="Level 2 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:desc="Level 3 Channel Priority Number" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:desc="Level 3 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
